[InteractiveObjects.Iris_Forge_GenericSwitch1 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.Iris_Forge_GenericSwitch2 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.Iris_Forge_GenericSwitch3 InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_IrisForgeKey MissionItemDefinition]
UseFailureCharacterMessage="It's your turn %s Use this article.."
ItemName="Torgy Forge Castle"
PickupMessage="It depends on you %s"
UseFailureLevelMessage="You must be at least %d to order this item."
UseFailureConstraintsMessage="You cannot use this item.."
NoManufacturerName="in general"

[ItemDefs.ID_IrisForgeKey:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Metal door opening aids."
NoConstraintText=""
Suffix=""
Prefix=""

